## Plan Result (883: stg_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 7 to change, 5 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_rotating.rotate
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_account.storage_account
* Replace
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].time_static.pim_expiry
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].time_static.pim_expiry




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
      ~ auto_pause_delay_in_minutes                                = 0 -> -1
        id                                                         = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-stg/databases/MetadataControl"
        name                                                       = "MetadataControl"
        tags                                                       = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00curatedstg"
        name                               = "ingest00curatedstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["curated"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 8 -> (known after apply)
      ~ id      = "2025-05-16T08:26:35Z" -> (known after apply)
      ~ minute  = 26 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T08:26:35Z" -> (known after apply) # forces replacement
      ~ second  = 35 -> (known after apply)
      ~ unix    = 1747383995 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00externalstg"
        name                               = "ingest00externalstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 8 -> (known after apply)
      ~ id      = "2025-05-16T08:26:35Z" -> (known after apply)
      ~ minute  = 26 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T08:26:35Z" -> (known after apply) # forces replacement
      ~ second  = 35 -> (known after apply)
      ~ unix    = 1747383995 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00landingstg"
        name                               = "ingest00landingstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 8 -> (known after apply)
      ~ id      = "2025-05-16T08:26:35Z" -> (known after apply)
      ~ minute  = 26 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T08:26:35Z" -> (known after apply) # forces replacement
      ~ second  = 35 -> (known after apply)
      ~ unix    = 1747383995 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00rawstg"
        name                               = "ingest00rawstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 8 -> (known after apply)
      ~ id      = "2025-05-16T08:26:35Z" -> (known after apply)
      ~ minute  = 26 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T08:26:35Z" -> (known after apply) # forces replacement
      ~ second  = 35 -> (known after apply)
      ~ unix    = 1747383995 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00workspacestg"
        name                               = "ingest00workspacestg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 16 -> (known after apply)
      ~ hour    = 8 -> (known after apply)
      ~ id      = "2025-05-16T08:26:35Z" -> (known after apply)
      ~ minute  = 26 -> (known after apply)
      ~ month   = 5 -> (known after apply)
      ~ rfc3339 = "2025-05-16T08:26:35Z" -> (known after apply) # forces replacement
      ~ second  = 35 -> (known after apply)
      ~ unix    = 1747383995 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["xcutting"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingstg"
        name                               = "ingest00xcuttingstg"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "staging"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Compute"
      + tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "staging"
          + "startupMode"         = "always"
        }
      + type                        = "CustomScriptExtension"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-stg"
    }

Plan: 11 to add, 7 to change, 5 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].module.storage["curated"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T08:26:35Z"
      - rotation_rfc3339 = "2025-05-16T08:26:35Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T08:26:35Z"
      - rotation_rfc3339 = "2025-05-16T08:26:35Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T08:26:35Z"
      - rotation_rfc3339 = "2025-05-16T08:26:35Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T08:26:35Z"
      - rotation_rfc3339 = "2025-05-16T08:26:35Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-05-21T08:26:35Z"
      - rotation_rfc3339 = "2025-05-16T08:26:35Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":95,"Program":"tfcmt","SHA1":"","Target":"883: stg_landing - TerraformPlanApply","Vars":{}} -->